let age = prompt('Скільки вам років?');
const city = prompt('В якому місті ви живете?');
const sport = prompt('Який ваш улюболений вид спорту?');

if(age !== null) {
    age = Number(age);
    if (city === 'Київ') {
        if (sport === 'Бокс') {
            alert(`Твій вік: ${age}. Ти живеш в столиці України. Круто! Хочеш стати Олександром Усиком?`);
        } else if (sport === 'Футбол') {
            alert(`Твій вік: ${age}. Ти живеш в столиці України. Круто! Хочеш стати Андрієм Ярмоленко?`);
        } else if (sport === 'Баскетбол') {
            alert(`Твій вік: ${age}. Ти живеш в столиці України. Круто! Хочеш стати Святославом Михайлюком?`);
        } else  if (sport !== null) {
            alert(`Твій вік: ${age}. Ти живеш в столиці України. Твій улюблений вид спорту: ${sport}.`);
        } else alert('Шкода що ви не захотіли ввести свій улюблений вид спорту.');
    } else if (city === 'Вашингтон') {
        if (sport === 'Бокс') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці США. Круто! Хочеш стати Олександром Усиком?`);
        } else if (sport === 'Футбол') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці США. Круто! Хочеш стати Андрієм Ярмоленко?`);
        } else if (sport === 'Баскетбол') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці США. Круто! Хочеш стати Святославом Михайлюком?`);
        } if (sport !== null) {
            alert(`Твій вік: ${age}. Ти живеш в столиці США. Твій улюблений вид спорту: ${sport}.`);
        } else alert('Шкода що ви не захотіли ввести свій улюблений вид спорту.');
    } else if (city === 'Лондон') {
        if (sport === 'Бокс') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці Велика Британія. Круто! Хочеш стати Олександром Усиком?`);
        } else if (sport === 'Футбол') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці Велика Британія. Круто! Хочеш стати Андрієм Ярмоленко?`);
        } else if (sport === 'Баскетбол') {
            alert(`Ваш вік: ${age}. Ти живеш в столиці Велика Британія. Круто! Хочеш стати Святославом Михайлюком?`);
        } if (sport !== null) {
            alert(`Твій вік: ${age}. Ти живеш в столиці Велика Британія. Твій улюблений вид спорту: ${sport}.`);
        } else alert('Шкода що ви не захотіли ввести свій улюблений вид спорту.');
    } else  if (city !== null) {
        if (sport === 'Бокс') {
            alert(`Ваш вік: ${age}. Ти живеш у місті ${city}. Круто! Хочеш стати Олександром Усиком?`);
        } else if (sport === 'Футбол') {
            alert(`Ваш вік: ${age}. Ти живеш у місті ${city}. Круто! Хочеш стати Андрієм Ярмоленко?`);
        } else if (sport === 'Баскетбол') {
            alert(`Ваш вік: ${age}. Ти живеш у місті ${city}. Круто! Хочеш стати Святославом Михайлюком?`);
        } if (sport !== null) {
            alert(`Твій вік: ${age}. Ти живеш в столиці ${city}. Твій улюблений вид спорту: ${sport}.`);
        } else alert('Шкода що ви не захотіли ввести свій улюблений вид спорту.');
    } else alert('Шкода, що Ви не захотіли ввести свіє місто.');
} else alert('Шкода, що Ви не захотіли ввести свію дату народження.');
